let heart = document.querySelector('.heart')
let card = document.querySelector('.card')
let box = document.querySelector('#box')
heart.addEventListener('click',function(){
    card.setAttribute("style","opacity:0");
    let x = document.createElement("audio");
     x.setAttribute("src", "bgm.mp3");
     x.setAttribute("preload", "preload");
     x.setAttribute("autoplay",'autoplay');

// 打字效果
let i =0
let str = 'Hello鸭！谯亚琳！我还是喜欢叫你小琳，毕竟你说只有我会这样叫你。<不知道我最后会不会把这封信给你，最起码在我写下这些的时候我还没有决定。但就算没有给你，我也想给我自己留个记录。嘿嘿嘿！<其实我已经不太记得我们认识具体是哪天了，因为当时我根本没有想过我们之间会发生这么多的事情，这么得让我难忘。但我记得那天应该是2022年6月初的一个雨天，如果是说我认识你的话应该是这前一天，一眼就觉得这个女生好漂亮，哈哈哈，只是你肯定没印象。那天晚上，那场雨，从没想过会那么巧。说实话，当你披着外套冲出去的时候，我的心里是紧了一下的，好像就觉得我跟你应该没啥缘分了。看到你又回来问我们的时候，我真的那一段时间脑子都是空白的，我的心脏真的在狂跳，就像跑完几千米那样。我想跟你要微信，但是我的嘴真的张不开，我从来没要过女生的微信，我那时真的是太废物了。还好最后那哥们冲上去了，真的要好好感谢他。<从那之后，我开始每天找你聊天，因为我之前根本是一个不爱说话的人，就算是我那些朋友我也基本没有主动跟他们说过话，都是他们有事儿找我的时候我会跟他们聊几句。我每天都在想以什么理由找你，那段时间能每天晚上送你回宿舍，多亏了朋友的小电驴了，哈哈哈哈。那段时间想来是最最最开心的时候了。每天能看到你，给丢三落四的你送耳机，第一次一起去吃烧烤，第一次陪一个女生逛街......<你毕业那天，我发的最后一条消息你没有回，我就想我们的缘分好像就这样了吧，你已经毕业要去工作了，而我还在学校里面，我要不就不去找你聊天了吧。虽然那段时间确实没找过你，但还是每天会想你。我自己都不知道为啥那天晚上跑完步回来会有勇气找你的，我也没想到你会那么热情地回复我，现在想来可能是出于礼貌，可能是你性格就这样大大咧咧的。反正不管原因是什么，我又开始每天去“烦”你了，哈哈哈哈。直到你回了南京之后，我心里又有了希望。我很想和你见面，聊天再多也没有一次见面有意义，所以我死皮赖脸的去见了你几次。<但后来，慢慢地，我感觉到你好像不是那么地想见我了，我也很难再约到你了，所以我想我是不是应该放弃了。<九月底的那个晚上，我最终还是把你删掉了，我后来解释说我恋爱脑，事情多确实没有骗你，但那也只是部分原因，主要还是我觉得我对你来说好像并不重要，我的热情好像成为了你的负担。<在那三个月的时间里，我想通了很多。我也去偷偷看过你，没被你发现，看到你在认真工作，感觉你真的很认真地在生活。我也去了一次鱼嘴，虽说是为了陪伤心的室友，但其实是因为你曾经陪一个人去过那，我想去看看。那里的日落真的很浪漫，那天我也很伤心，我真希望那次陪你的人是我，可惜，没机会了。<在把你加回来前，其实我已经想过了。我确实很很很喜欢你，正因为这样我希望的是你能每天开开心心的。虽然删了你，但是从他们的手机里看到你的朋友圈，我知道你其实已经很开心了，我反而会打扰你。更重要的是，我现在还在上学，没有能力，以后还不知道，也是个未知数，我没办法给你你想要的幸福生活。既然这样，那我都在干什么呢。我想，那个人肯定是要比我优秀很多的人，最重要的是你要喜欢他，他也要喜欢你。有一点，我要申明，我绝不承认他比我爱你。绝！不！承！认！这样的结果会比我好太多了。<所以，从我再把你加回来的那一刻起，我就没有那么偏执了。我也减少了找你的频率，我本身就是一个很无聊的人，不想再用我的无聊去打扰你。只有那些我觉得真的有意思的事情，我才会分享给你，这样其实就挺好了。<关于礼物，你总是很抗拒，但是我想说，每次当你接过我的礼物的时候，可能我才是最开心的那个人。送你礼物是为了让你开心，但既然他带给你负担了，那我就打算放弃了。但过两天最后一份生日礼物，我无论如何都会送的，我想把我当初说的话都做到，不想留下什么遗憾。<之后的话，我就不再去打扰你的生活了，我不会再傻傻地去删掉你了，根本没用，就留在那儿吧。但我还是会屏蔽掉朋友圈的，因为我自己知道看到朋友圈的你的话，我还是会想起你，那我就永远都放不下，甚至我连小红书都卸载掉了，哈哈哈哈。所以，我想尽量减少能看到你消息的途径，慢慢去接受吧。但要是你真遇到什么烦心事儿了，如果你愿意找我，我一直都在。<都说每个人一生中都会有一个爱而不得的人，而我的白月光能是你，小琳，我觉得，不赖！<最后的最后，之前看到过一句话，没想到这么快就用上了：<“你的头发乱了哦！”——永远爱你的峰峰'
let strp = ''

function print()
{
 if(str[i]=='<')
 {
     document.getElementById("box").innerHTML=strp+"<br><br>+'|'";
     strp+="<br><br>";
 }
 else
 {
     strp+=str[i];
     box.innerHTML=strp + '|';
 }
 i++;
}
setTimeout(() => {
    let printid=setInterval(() => {
        print();
        if(i==str.length)
        clearInterval(printid);
        },100);  // 190毫秒打一个字，其实细心发现的话，这个项目还是有个小小的bug，无法用语言描述这个bug，如果你想优化的话 有一种简单的方法就是调快打字的速度，这样那个bug看起来就不会很明显,我太菜了 不会改那个bug
}, 5000);  //5500毫秒开始打字
// 背景出现
function appearBackground(){
setTimeout(()=>{
box.style.opacity=1
},1500)
}
appearBackground()

})
